Workshop-6/app/Models/ModeloCarrera.php

SELECT *
FROM `carreras`
---
    public function obtenerCarreras()
    {
        return $this->findAll();

SELECT *
FROM `carreras`
WHERE `carreras`.`id` = '1'
---
    public function obtenerCarrera($id)
    {
        return $this->find($id);

UPDATE `carreras` SET `nombre` = 'Musica'
WHERE `carreras`.`id` IN ('1')
---
    public function actualizarCarrera($id, $data)
    {
        return $this->update($id, $data);