Workshop-6/app/Models/ModeloEstudiante.php

    public function obtenerEstudiantes()
    {
        return $this->select('estudiantes.id, estudiantes.nombre, carreras.nombre as nombre_carrera')
        ->join('carreras', 'carreras.id = estudiantes.id_carrera')
        ->orderBy('estudiantes.id', 'ASC')
        ->findAll();
---
SELECT `estudiantes`.`id`, `estudiantes`.`nombre`, `carreras`.`nombre` as `nombre_carrera`
FROM `estudiantes`
JOIN `carreras` ON `carreras`.`id` = `estudiantes`.`id_carrera`
ORDER BY `estudiantes`.`id` ASC

    public function actualizarEstudiante($id, $data)
    {
        return $this->update($id, $data);
---
UPDATE `estudiantes` SET `nombre` = 'Enocc', `id_carrera` = '1'
WHERE `estudiantes`.`id` IN ('1')